{
    "about-title": "About",
    "about-school": "Student in BUT Computer Science at Anglet (IUT of Bayonne and the Basque Country)",
    "about-description": "Passionate about computer science, I am currently honing my programming and computing skills. Always curious and eager to learn, I am particularly interested in new technologies and innovation. Motivated, I seek to apply my knowledge to concrete projects to actively contribute to the digital world of tomorrow.",
    "projects-title": "Projects",
    "projects": [
        {
            "name": "AlgoForge",
            "description": "AlgoForge is an innovative tool that replaces TabulaRasa, an algorithmic editing platform, by integrating an anomaly detection feature. The application allows users to efficiently identify and correct errors in their algorithms. Developed during my studies, this project was an excellent opportunity to deepen my programming skills.",
            "image": "AlgoForge.png",
            "tags": ["JavaScript", "ProjectManagement"],
            "lienGithub": "https://github.com/Bing-Chill-inc/Algoforge"
        },
        {
            "name": "Package Counting Application",
            "description": "This web application predicts the billing cost based on the number of packages sent for each customer. Developed during my second-year internship, it uses Angular and MySQL for data management. Users can create accounts and obtain cost estimates, thus facilitating logistics.",
            "image": "e-scm.png",
            "tags": ["Angular", "Java", "MySQL", "ProjectManagement"]
        },
        {
            "name": "CD Catalogue",
            "description": "This mini school project offers an application that allows an administrator to add and remove CDs, as well as simulate a payment as a customer. This project helped me familiarize myself with PHP and MySQL.",
            "image": "cd.avif",
            "tags": ["JavaScript", "PHP", "MySQL"],
            "lienGithub": "https://github.com/Fetnmax/catalogueCDAngular"
        },
        {
            "name": "Hot Sauce",
            "description": "A mini school project allowing users to create an account, add sauces, and like or dislike sauces. Developed with Laravel, this project illustrates my backend development and database management skills.",
            "image": "hot-deal.png",
            "tags": ["Laravel", "MySQL"],
            "lienGithub": "https://github.com/Fetnmax/ProjetLaravel"
        },
        {
            "name": "Chat Server",
            "description": "Prototype of a chat server where users can send messages, create and delete discussion channels. This project allowed me to put into practice my programming skills in C.",
            "image": "messagerie.png",
            "tags": ["C"]
        },
        {
            "name": "Memory",
            "description": "An educational game developed in the terminal where players must find pairs of identical cards. This project allowed me to develop my skills in C++ and apply object-oriented programming concepts.",
            "image": "memory.webp",
            "tags": ["CPlus"]
        }
    ],
    "skills-title": "Skills",
    "competences": [
        {
            "nom": "PHP",
            "categorie": "BackEnd"
        },
        {
            "nom": "C",
            "categorie": "BackEnd"
        },
        {
            "nom": "JavaScript",
            "categorie": "FrontEnd"
        }
    ],
    "degrees-title": "Degrees",
    "degrees": [
        {
            "name": "BUT - IUT of Bayonne and the Basque Country",
            "description": "Knowledge and technical skills specialized in computer science: networks, databases (including SQL), programming through mastery of languages and development tools in the field (C++, C#, Python, etc.)",
            "startYear": 2022,
            "endYear": 2025
        },
        {
            "name": "Bac STI2D - Lycée Hasparen",
            "description": "This program provided me with technological skills.",
            "startYear": 2019,
            "endYear": 2021
        }
    ],
    "contact-title": "Contact"
}
